Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: You can also verify that this is a tree object:
es: También puedes comprobar si realmente es un objeto tipo árbol:

source: Instead of being primarily based on the project, GitHub is user centric.
es: En lugar de estar focalizado en los proyectos, GitHub gira en torno a los usuarios.

source: She runs a `git fetch` to pull down those changes:
es: Ella lanza un 'git fetch' para recuperar dichos cambios:

source: Git operates slightly differently if you explicitly specify `file://` at the beginning of the URL.
es: Git trabaja ligeramente distinto si indicas 'file://' de forma explícita al comienzo de la URL.

source: The process works as follow (see Figure 5-2):
es: El proceso funciona de la siguiente manera (ver Figura 5-2):

source: Next, you’ll write the other two commit objects, each referencing the commit that came directly before it:
es: Puedes seguir adelante, escribiendo los otros dos objetos de confirmación de cambios. Y relacionando cada uno de ellos con su inmediato anterior:

source: To remove a file named passwords.txt from your entire history, you can use the `--tree-filter` option to `filter-branch`:
es: Por ejemplo, para quitar un archivo llamado passwords.txt del repositorio, se puede emplear la opción `--tree-filter` del comando `filter-branch`:

source: You can decide what files go into which commits right before you commit with the staging area, you can decide that you didn’t mean to be working on something yet with the stash command, and you can rewrite commits that already happened so they look like they happened in a different way.
es: Las decisiones sobre qué archivos van en qué confirmaciones de cambio se toman justo inmediatamente antes de confirmar, utilizando para ello el área de preparación (staging area). En cualquier momento se puede decidir dejar de trabajar en una cierta vía y arrancar en otra, utilizando el comando de guardado rápido (stash). Y también es posible reescribir confirmaciones de cambio ya realizadas, para que se muestren como si hubieran sido realizadas de otra forma.

source: What you really want to see are the changes added to the topic branch — the work you’ll introduce if you merge this branch with master.
es: Y lo que realmente querías ver eran los cambios introducidos por la rama puntual, --el trabajo que vas a introducir si la fusionas con la rama 'master'--.

source: It turns out you can do this fairly well using Git attributes.
es: Pero resulta que puedes hacerlo bastante mejor utilizando los atributos Git.

source: This can take several seconds or even minutes, depending on the size of the project, whereas in Git the process is always instantaneous.
es: Lo que puede llevar segundos o incluso minutos, dependiendo del tamaño del proyecto. Mientras que en Git el proceso es siempre instantáneo.

source: Do as I say, not as I do.
es: Observa mis palabras, no mis hechos.

source: Your staging area now has the new version of test.txt as well as the new file new.txt.
es: El área de preparación contendrá ahora la nueva versión de test.txt, así como el nuevo archivo new.txt.

source: This doesn’t affect the commit data in any way — the SSH user you connect as doesn’t affect the commits you’ve recorded.
es: Esto no afecta a los datos de las confirmaciones (commit), ya que el usuario SSH con el que te conectes no es relevante para las confirmaciones de cambios que registres.

source: ### Short SHA ###
es: ### SHA corto ###

source: ### Adding Collaborators ###
es: ### Añadiendo colaboradores ###

source: After a topic branch merge.
es: Tras fusionar una rama puntual.

source: The GitHub user dashboard.
es: El panel de control del usuario GitHub.

source: Because commits contain the SHA-1 values of their parents, this command changes every commit SHA in your history, not just those that have the matching e-mail address.
es: Y, debido a que cada confirmación de cambios contiene el código SHA-1 de sus ancestros, este comando cambia también todos los códigos SHA del historial; no solamente los de las confirmaciones de cambio que contenian la dirección indicada.

source: This tells Git that any file that matches this pattern (.doc) should use the "word" filter when you try to view a diff that contains changes.
es: Así decimos a Git que sobre cualquier archivo coincidente con el patrón indicado, (.doc), ha de utilizar el filtro "word" cuando intentente hacer una comparación con él.

source: The server-side hooks are for Git server operations such as receiving pushed commits.
es: Los del lado servidor están relacionados con operaciones tales como la recepción de contenidos enviados (push) a un servidor.

source: In the 1.6 series of Git, you can use the Git attributes functionality to effectively diff binary files.
es: A partir de la versión 1.6, puedes utilizar los atributos Git para comparar archivos binarios.

source: ### Commit Guidelines ###
es: ### Reglas para las confirmaciones de cambios (commits) ###

source: Because Git doesn’t have monotonically increasing numbers like 'v123' or the equivalent to go with each commit, if you want to have a human-readable name to go with a commit, you can run `git describe` on that commit.
es: Debido a que Git no dispone de una serie monótona ascendente de números para cada confirmación de cambios (commit), si deseas tener un nombre humanamente comprensible por cada confirmación, has de utilizar el comando 'git describe'.

source: If you do this immediately after an import, before anyone has started to base work on the commit, you’re fine — otherwise, you have to notify all contributors that they must rebase their work onto your new commits.
es: No tendrás problemas si lo haces inmediatamente despues de una importación; o justo antes de que alguien haya comenzado a trabajar con la confirmación de cambios modificada. Pero si no es el caso, tendrás que avisar a todas las personas que hayan contribuido. Porque se verán obligadas a reorganizar su trabajo en base a tus nuevas confirmaciones de cambio.

source: The most basic is the _Local protocol_, in which the remote repository is in another directory on disk.
es: El más básico es el _Protocolo Local_, donde el repositorio remoto es simplemente otra carpeta en el disco.

source: Jessica’s history now looks like Figure 5-8.
es: El historial de Jessica es en estos momentos como se muestra en la figura 5-8.

source: If you set this as your 'git' user’s login shell, then the 'git' user can’t have normal shell access to your server.
es: Si lo configuras como el shell de inicio de sesión de tu usuario 'git', dicho usuario no tendrá acceso al shell normal del servidor.

source: The Git daemon checks that the command can be run and that the repository exists and has public permissions.
es: El demonio Git realizará las comprobaciones de si el comando se puede lanzar, si el repositorio existe y si tenemos permisos.

source: The branch that HEAD points to moves forward with each commit.
es: La rama apuntada por HEAD avanza con cada confirmación de cambios.

source: To tell Git to use it as the default message that appears in your editor when you run `git commit`, set the `commit.template` configuration value:
es: Para indicar a Git que lo utilice como mensaje por defecto y que aparezca en tu editor cuando lances el comando 'git commit', tan solo has de ajustar 'commit.template':

source: The diff wrapper checks to make sure seven arguments are provided and passes two of them to your merge script.
es: El script para el comparador, ha de asegurarse de recibir siete argumentos y de pasar dos de ellos al script de fusion (merge).

source: Branches on this list without the `*` in front of them are generally fine to delete with `git branch -d`; you’ve already incorporated their work into another branch, so you’re not going to lose anything.
es: Y no lleva por delante el caracter '*' porque todo su contenido ya ha sido incorporado a otras ramas. Podemos borrarla tranquilamente con 'git branch -d', sin miedo a perder nada.

source: If you treat rebasing as a way to clean up and work with commits before you push them, and if you only rebase commits that have never been available publicly, then you’ll be fine.
es: Si solo usas la reorganización como una vía para hacer limpieza y organizar confirmaciones de cambio antes de enviarlas, y si únicamente reorganizas confirmaciones que nunca han sido públicas. Entonces no tendrás problemas.

source: The client initiates a `fetch-pack` process that connects to an `upload-pack` process on the remote side to negotiate what data will be transferred down.
es: El cliente arranca un proceso `fetch-pack`, para conectar con un proceso `upload-pack` en el lado servidor y negociar con él los datos a transferir.

source: We also assume you’re running a standard Linux distribution like Ubuntu.
es: Se asume que tienes un servidor en marcha, con una distribución estandar de Linux, tal como Ubuntu.

source: You do that by having Git compare the last commit on your topic branch with the first common ancestor it has with the master branch.
es: Lo puedes hacer indicando a Git que compare la última confirmación de cambios en la rama puntual, con el más reciente ancestro común que tenga esta respecto de la rama 'master'.

source: Now you have a topic branch that contains contributed work.
es: Ahora que tienes una rama puntual con trabajo aportado por otras personas.

source: This chapter has covered a number of plumbing commands — commands that are lower level and simpler than the porcelain commands you’ve learned about in the rest of the book.
es: En este capítulo se han visto unos cuantos comandos "de fontanería". Comandos de menor nivel y más simples que los "de porcelana" que hemos estado viendo en el resto del libro.

source: Notice that this tree has both file entries and also that the test.txt SHA is the "version 2" SHA from earlier (`1f7a7a`).
es: Aquí se vén las entradas para los dos archivos y también el que la suma de comprobación SHA-1 de test.txt es la "segunda versión" de la anterior (`1f7a7a`).

source: In this case, you’re specifying a mode of `100644`, which means it’s a normal file.
es: En este caso, indicas un modo `100644`, el modo que denota un archivo normal.

source: First, she switches back to her master branch to integrate all this work:
es: Primero, se posiciona de nuevo en su rama principal para integrar todo su trabajo:

source: How does Git do this?
es: ¿Cómo consigue Git esto?

source: The HTTP protocol also isn’t very resource intensive on your server.
es: Además, el procolo HTTP no requiere de grandes recursos en tu servidor.

source: Git checks out a working copy of the `master` branch that was pointed to by the HEAD reference you downloaded at the beginning.
es: Git activa una copia de trabajo de la rama `master` señalada por la referencia HEAD que has descargado al principio.

source: Your initial diverged commit history.
es: El registro de confirmaciones inicial.

source: Now you have the Rack project under a subdirectory named `rack` within your project.
es: A partir de este momento, el proyecto Rack está dentro de nuestro proyecto; bajo una subcarpeta denominada `rack`.

source: If you’re using a version of Git earlier than 1.6, the `mv` command isn’t necessary — Git started naming the hooks examples with the .sample postfix only recently.
es: Si utilizas una versión de Git anterior a la 1.6, el comando 'mv' no es necesario, ya que solo recientemente lleva Git los anclajes de ejemplo con el sufijo .sample

source: You can see this by creating an annotated tag (`-a` specifies that it’s an annotated tag):
es: Puedes comprobarlo creando una: (la opción `-a` indica que la etiqueta es anotativa)

source: In essence, you want to treat it like a binary file.
es: Y es preferible tratarlos como si fueran archivos binarios.

source: Although `rack` is a subdirectory in your working directory, Git sees it as a submodule and doesn’t track its contents when you’re not in that directory.
es: Aunque `rack` es una subcarpeta de la carpeta de trabajo, git la contempla como un submódulo y no realiza seguimiento de sus contenidos si no se está situado directamente sobre ella.

source: In the meantime, Jessica has been working on a topic branch.
es: Mientras tanto, jessica ha seguido trabajando en una rama puntual (topic branch).

source: `--reuseaddr` allows the server to restart without waiting for old connections to time out, the `--base-path` option allows people to clone projects without specifying the entire path, and the path at the end tells the Git daemon where to look for repositories to export.
es: El parámetro '--reuseaddr' permite al servidor reiniciarse sin esperar a que se liberen viejas conexiones; el parámetro '--base-path' permite a los usuarios clonar proyectos sin necesidad de indicar su camino completo; y el camino indicado al final del comando mostrará al demonio Git dónde buscar los repositorios a exportar.

source: In the `.gitattributes` file, you can set a filter for particular paths and then set up scripts that will process files just before they’re committed ("clean", see Figure 7-2) and just before they’re checked out ("smudge", see Figure 7-3).
es: En el archivo '.gitattibutes', puedes indicar filtros para carpetas o archivos determinados y luego preparar tus propios scripts para procesarlos justo antes de confirmar cambios en ellos ("clean", ver Figura 7-2), o justo antes de recuperarlos ("smudge", ver Figura 7-3).

source: Generally, this script is used for notification or something similar.
es: Habitualmente, este script final se suele utilizar para realizar notificaciones o tareas similares.

source: This entire chapter basically deals with the stuff in this directory.
es: Todo este capítulo se encarga de repasar el contenido en dicha carpeta.

source: ### Creating a Branch from a Stash ###
es: ### Creando una rama desde un guardado rápido temporal ###

source: The double-dot syntax is useful as a shorthand; but perhaps you want to specify more than two branches to indicate your revision, such as seeing what commits are in any of several branches that aren’t in the branch you’re currently on.
es: La sintaxis del doble-punto es util como atajo. Pero en algunas ocasiones interesa indicar mas de dos ramas para precisar la revisión. Como cuando se desea ver las confirmaciones de cambio presentes en cualquiera de varias ramas y no en la rama activa.

source: Ahh, but the bliss of rebasing isn’t without its drawbacks, which can be summed up in a single line:
es: Ahh...., pero la dicha de la reorganización no la alcanzamos sin sus contrapartidas:

source: ### Basic Client Configuration ###
es: ### Configuración básica del cliente Git ###

source: You’ve just done the low-level operations to build up a Git history without using any of the front ends.
es: Acabas de confeccionar un historial Git utilizando solamente operaciones de bajo nivel, sin usar ninguno de los interfaces principales.

source: ## Submodules ##
es: ## Submódulos ##

source: That’s all we’ll cover about GitHub, but it’s important to note how quickly you can do all this.
es: Esto es todo lo que vamos a ver aquí sobre GitHub, pero merece la pena destacar lo rápido que puedes hacer todo esto.

source: You can also do `git push origin serverfix:serverfix`, which does the same thing — it says, “Take my serverfix and make it the remote’s serverfix.” You can use this format to push a local branch into a remote branch that is named differently.
es: También puedes hacer 'git push origin serverfix:serverfix', que hace lo mismo; es decir: "coge mi 'serverfix' y hazlo el 'serverfix' remoto". Puedes utilizar este último formato para llevar una rama local a una rama remota con otro nombre distinto.

source: If this script exits non-zero, Git aborts the commit process, so you can use it to validate your project state or commit message before allowing a commit to go through.
es: Si este script termina con un código de salida distinto de cero, Git aborta el proceso de confirmación de cambios; permitiendo así validar el estado del proyecto o el mensaje de confirmación antes de permitir continuar.

source: Insert 18333fig0312.png Figure 3-12.
es: Insert 18333fig0312.png Figura 3-12.

source: Now the first two commits aren’t reachable by anything:
es: Con eso, perdemos completamente el acceso a las dos primeras confirmaciones de cambio:

source: HEAD moves to another branch on a checkout.
es: HEAD apunta a otra rama cuando hacemos un checkout.

source: In order to do that, you’ll merge in your `iss53` branch, much like you merged in your `hotfix` branch earlier.
es: Para ello, de forma similar a como antes has hecho con la rama 'hotfix', vas a fusionar la rama 'iss53'.

source: Another interesting problem you can solve this way involves diffing image files.
es: Otro problema donde puede ser util esta técnica, es en la comparación de imágenes.

source: Since you have no code there yet, GitHub will show you instructions for how create a brand-new project, push an existing Git project up, or import a project from a public Subversion repository (see Figure 4-7).
es: Como aún no tienes código, GitHub mostrará instrucciones sobre cómo iniciar un nuevo proyecto, cómo enviar (push) un proyecto Git preexistente, o cómo importar un proyecto desde un repositorio público Subversion (ver Figura 4-7).

source: Your Git repository now contains five objects: one blob for the contents of each of your three files, one tree that lists the contents of the directory and specifies which file names are stored as which blobs, and one commit with the pointer to that root tree and all the commit metadata.
es: En este momento, el repositorio de Git contendrá cinco objetos: un "blob" para cada uno de los tres archivos, un árbol con la lista de contenidos de la carpeta (más sus respectivas relaciones con los "blobs"), y una confirmación de cambios (commit) apuntando a la raiz de ese árbol y conteniendo el resto de metadatos pertinentes.

source: You can tell Git not to export certain files or directories when generating an archive.
es: Puedes indicar a Git que ignore y no exporte ciertos archivos o carpetas cuando genera un archivo de almacenamiento.

source: We’ll walk though installing GitWeb manually very quickly.
es: Enseguida vamos a revisar el proceso de instalar GitWeb manualmente.

source: ## Basic Branching and Merging ##
es: ## Procedimientos básicos para ramificar y fusionar ##

source: Or maybe you have a bunch of automated build servers or continuous integration servers that change a lot, and you don’t want to have to generate SSH keys all the time — you just want to add simple anonymous read access.
es: O si tienes un grupo de servidores de integración automatizados o servidores de integración continua que cambian muy a menudo, y no quieres estar todo el rato generando claves SSH. Es posible que desees añadirles un simple acceso anónimo de lectura.

source: You may see some other files in there, but this is a fresh `git init` repository — it’s what you see by default.
es: Puede que veas algunos otros archivos en tu carpeta '.git', pero este es el contenido de un repositorio recién creado tras ejecutar 'git init', --es la estructura por defecto--.

source: All the sample hook scripts distributed with Git are in either Perl or Bash scripting, so you can also see plenty of examples of hooks in those languages by looking at the samples.
es: Todos los script de ejemplo que vienen de serie con Git están escritos en Perl o en Bash shell, por lo que tienes bastantes ejemplos en esos lenguajes de scripting.

source: Insert 18333fig0413.png Figure 4-13.
es: Insert 18333fig0413.png Figura 4-13.

source: To demonstrate having multiple remote servers and what remote branches for those remote projects look like, let’s assume you have another internal Git server that is used only for development by one of your sprint teams.
es: Para ilustrar mejor el caso de tener múltiples servidores y cómo van las ramas remotas para esos proyectos remotos. Supongamos que tienes otro servidor Git; utilizado solamente para desarrollo, por uno de tus equipos sprint.

source: Let’s use `gitserver` as the hostname of the server on which you’ve set up your 'git' user and repository.
es: Suponiendo, por ejemplo, que se llame 'gitserver' el servidor donde has puesto el usuario 'git' y los repositorios;

source: To clone a Git repository over SSH, you can specify ssh:// URL like this:
es: Para clonar un repositorio a través de SSH, puedes indicar una URL ssh:// tal como:

source: The answer to this dilemma is to provide some client-side hooks that users can use to notify them when they’re doing something that the server is likely to reject.
es: La solución a este dilema es el proporcionarles algunos enganches (hook) del lado cliente, para que les avisen cuando están trabajando en algo que el servidor va a rechazarles.

source: For example, if you’ve added a line in a file on the `master` branch, a direct comparison of the snapshots will look like the topic branch is going to remove that line.
es: Por ejemplo, si en la rama 'master' habias añadido una línea a un archivo, la comparación directa de instantáneas te llevará a pensar que la rama puntual va a borrar dicha línea.

source: A common issue arises in these scenarios: you want to be able to treat the two projects as separate yet still be able to use one from within the other.
es: La preocupación típica en estos escenarios suele ser la de cómo conseguir tratar ambos proyectos separadamente. Pero conservando la habilidad de utilizar uno dentro del otro.

source: #### Merging Workflows ####
es: #### Fusionando flujos de trabajo ####

source: Let’s look at one more possible scenario: the maintainer has looked at work in your second branch and likes the concept but would like you to change an implementation detail.
es: Vamos a ver otro posible escenario: el gestor del proyecto ha revisado tu trabajo en la segunda rama y le ha gustado el concepto, pero desea que cambies algunos detalles de la implementación.

source: Next, you have a hotfix to make.
es: Volviendo al problema urgente.

source: It turns out there is no issue here, and you tell Git that by typing `git bisect good` and continue your journey:
es: Por ejemplo, si resultara que no se detecta el problema aquí, se indicaria esta circunstancia a Git tecleando `git bisect good`; para continuar la búsqueda:

source: To avoid this issue, create a branch when you work in a submodule directory with `git checkout -b work` or something equivalent.
es: Para evitarlo, siempre se ha de crear una rama cuando se trabaje en la carpeta de un submódulo; usando `git checkout -b trabajo` o algo similar.

source: That means when I host my `grit` project on GitHub, you won’t find it at `github.com/grit` but instead at `github.com/schacon/grit`.
es: Esto significa que, cuando alojo mi proyecto 'grit' en GitHub, no lo encontraras bajo 'github.com/grit', sino bajo 'github.com/schacon/grit'.

source: You can run auto gc manually as follows:
es: También puedes lanzar "auto gc" manualmente:

source: One central hub, or repository, can accept code, and everyone synchronizes their work to it.
es: Un repositorio o punto central guarda el código fuente; y todo el mundo sincroniza su trabajo con él.

source: ### Public Large Project ###
es: ### Proyecto Público Grande ###

source: The first thing this command does is pull down the `info/refs` file.
es: Lo primero que hace este comando es recuperar el archivo `info/refs`.

source: ## Getting Git on a Server ##
es: ## Poniendo Git en un Servidor ##

source: ### Staging Patches ###
es: ### Parches en la preparación ###

source: You can see a file in the `objects` directory.
es: Como puedes ver, hay un archivo en la carpeta 'objects'.

source: ### Basic Branching ###
es: ### Procedimientos básicos de ramificación ###
